system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	rhoEnergyFoamiOriginalOpt;

startFrom       	latestTime; //startTime;

startTime       	0;

stopAt          	endTime;

endTime         	185;

deltaT          	0.000002;

writeControl    	adjustableRunTime;

writeInterval   	0.5; //1.0;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	true;

adjustTimeStep  	yes;

maxCo                   0.5; //1.0;

maxDeltaT       	1.;

pressArtDiff    	true; //activate artificial diffusion on pressure
convArtDiff     	true; //activate artificial diffusion on pressure

ducLevelPress      	 0.00;
ducLevelConv       	 0.05;
epsilon            	 0.744017399;  //chord = 1 (unitary)
minfty		   	 0.729;
kp                 	 0.25;
ku                 	 0.75;

functions
{
/* 
 #include "fieldAverageDict"
 
 forces
 {
	 type 			forces;
	 libs 			("libforces.so");
	 rhoName 		rho;
	 UName  		U;
	 pName  		p;
	 rhoInf 		1;
	 patches 		(airfoil);
	 CofR 			(0 0 0);
	 writeControl 		timeStep;
	 writeInterval 		1;
 }

 forceCoeffs
 {
	 // rhoInf - reference density
	 // CofR - Centre of rotation
	 // dragDir - Direction of drag coefficient
	 // liftDir - Direction of lift coefficient
	 // pitchAxis - Pitching moment axis
	 // magUinf - free stream velocity magnitude
	 // lRef - reference length
	 // Aref - reference area
	 type 			forceCoeffs;
	 functionObjectLibs 	("libforces.so");
	 patches 		(airfoil);
	 rhoName 		rho;
	 UName  		U;
	 pName  		p;
	 rhoInf 		1;
	 CofR 			(0 0 0);
	 liftDir 		(-0.0509415558090608 0.998701636071431 0);
	 dragDir 		(0.998701636071431  0.0509415558090608 0);
	 pitchAxis 		(0 0 1);
	 magUInf 		0.857831568549444;
	 lRef 			1; 
	 Aref 			1.; 
	 writeControl 		timeStep;
	 writeInterval 		1;
 }
 */
 
 writeduc
 {
        type 			writeObjects;
        libs 			("libutilityFunctionObjects.so");
        objects 		("ducSensor");
        writeControl 		outputTime;
        writeInterval       	1;
 }
 

}

// ************************************************************************* //
