constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    side1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          93840;
        startFace       187089;
    }
    side2
    {
        type            empty;
        inGroups        1(empty);
        nFaces          93840;
        startFace       280929;
    }
    outFlow
    {
        type            patch;
        nFaces          510;
        startFace       374769;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          304;
        startFace       375279;
    }
    inFlow
    {
        type            patch;
        nFaces          368;
        startFace       375583;
    }
)

// ************************************************************************* //
