0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.861863 0.0347667 0);

boundaryField
{
    side1
    {
        type            empty;
    }
    side2
    {
        type            empty;
    }
    outFlow
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            noSlip;
    }
    inFlow
    {
        type            inletOutlet;
        inletValue      uniform (0.861863 0.0347667 0);
        value           uniform (0.861863 0.0347667 0);
    }
}


// ************************************************************************* //
