system/forceCoeffsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      forceCoeffsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //  
type            forceCoeffs;
libs            ("libforces.so");
patches         (airfoil);
writeFields     yes;
CofR            (0 0 0);
liftDir         ( 0      0.0534 0);
dragDir         (-0.9986 0      0);
pitchAxis       (0 0 1);
magUInf         0.8626;
lRef            1;
Aref		1;
rho		rhoInf;
rhoInf		1;

// ************************************************************************* //
