system/pressureDict
/--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      pressureDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
    
    type            pressure;
    libs            ("fieldFunctionObjects");
    patches         (airfoil);
    writeFields     yes;
    p               pInf;
    U               UInf;
    rho             rhoInf;
    rhoInf          1.0; // enabled if rho=rhoInf
    pInf            1.0;
    UInf            (0.8613 0.0460 0);

// ************************************************************************* //
